# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
ser_1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = 'l'))
ser_2 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = 'l'))
ser_3 = pd.Series(np.random.randint(10000, high = 30001, size = 100, dtype = 'l'))

print(ser_1)
print(ser_2)
print(ser_3)

0     2
1     2
2     3
3     1
4     2
     ..
95    4
96    3
97    4
98    1
99    3
Length: 100, dtype: int32
0     1
1     1
2     1
3     1
4     2
     ..
95    2
96    1
97    2
98    3
99    2
Length: 100, dtype: int32
0     24594
1     26461
2     28387
3     14493
4     18866
      ...
95    20851
96    17361
97    11981
98    26145
99    25987
Length: 100, dtype: int32

In [ ]:
# code

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
house_mrkt = pd.concat([ser_1,ser_2,ser_3],axis = 1)
house_mrkt.head()

   0  1      2
0  2  1  24594
1  2  1  26461
2  3  1  28387
3  1  1  14493
4  2  2  18866

In [ ]:
# code

### Step 4. Change the name of the columns to bedrooms, bathrooms, price_sqr_meter

In [7]:
house_mrkt.rename(columns = {0: 'bedrooms', 1 : 'bathrooms', 2 : 'price_sqr_meter'},inplace= True)
house_mrkt.head()

   bedrooms  bathrooms  price_sqr_meter
0         2          1            24594
1         2          1            26461
2         3          1            28387
3         1          1            14493
4         2          2            18866

In [ ]:
# code

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
ocolumn = pd.concat([ser_1,ser_2,ser_3], axis = 0)
ocolumn = ocolumn.to_frame()
print(ocolumn)

        0
0       2
1       2
2       3
3       1
4       2
..    ...
95  20851
96  17361
97  11981
98  26145
99  25987

[300 rows x 1 columns]

In [ ]:
# code

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [9]:
len(ocolumn)

300

In [ ]:
# code

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
ocolumn.reset_index(drop = True, inplace = True)
ocolumn

         0
0        2
1        2
2        3
3        1
4        2
..     ...
295  20851
296  17361
297  11981
298  26145
299  25987

[300 rows x 1 columns]

In [ ]:
# code